// This script is for the purpose of "viewing" SPG data...
// The PDFs (as I will explain shortly in the future) are not decoding
// properly... (Can't copy and paste the chhands) Only part 1 is working as expected.
// This means, we will need to resort to a different method of getting the data (and
// then converting it to Unicode, english transliteration, etc...)

const fetchHelper = require('./helpers/fetchHelper');

const chhands = [];
const getChhands = async () => {
  for (let i = 1; i <= 10; i++) {
    try {
      const url = `https://data.searchgurbani.com/api/res/sri-nanak-prakash/page?page_no=${i}&label=volume&volume_id=2`;
      const data = await fetchHelper.fetchGet(url);
      chhands.push(data.lines[0].text);
    } catch (error) {
      console.log('Error', error);
    }
  }
};

// getChhands();

// Here is what 10 pages looks like:

// [
//   '੧੨੯੭\n' +
//     '\n' +
//     '                                      ੴ ਸਤਿਗੁਰ ਪ੍ਰਸਾਦਿ॥ \n' +
//     '                              ਸ਼੍ਰੀ ਗੁਰ ਨਾਨਕ ਪ੍ਰਕਾਸ਼ \n' +
//     '\n' +
//     '                          ਅਥ ਅੁਤਰਾਰਧ ਲਿਖਤੇ  \n' +
//     '\n' +
//     '     ਅਥ=ਦੇਖੋ ਪੂਰਬਾਰਧ, ਪਹਿਲੇ ਅਧਾਯ ਦੇ ਆਦਿ ਵਿਖੇ \n' +
//     '     ਅੁਤਰਾਰਧ\u001a=ਅੁਤਰ ਅਰਧ=ਅੁਤਰ=ਮਗਰਲਾ, ਅਖੀਰਲਾ ਅਰਧ=ਅਜ਼ਧ \n' +
//     '     ਸੰਸ: ਅੁਤਰਾਰਦਧ॥ ਲਿਖਤੇ=ਲਿਖਦੇ ਹਾਂ \n' +
//     'ਅਰਥ: ਹੁਣ (ਸ਼੍ਰੀ ਗੁਰੂ ਨਾਨਕ ਪ੍ਰਕਾਸ਼ ਨਾਮੇ ਗ੍ਰੰਥ ਦਾ) ਅਖੀਰਲਾ ਅਜ਼ਧਾ ਹਿਜ਼ਸਾ (ਜੋ ਬਾਕੀ \n' +
//     '         ਹੈ) ਲਿਖਦੇ ਹਾਂ  \n' +
//     '                   ੧. ਗੁਰਬਾਣੀ ਤੇ ਸ਼੍ਰੀ ਗੁਰ ਨਾਨਕ ਦੇਵ ਜੀ ਦਾ ਮੰਗਲ  \n' +
//     '                         ਧ੍ਰਜ਼ਵ ਤੋਣ ਵਿਦਾ, ਸ਼ੀਲਾਗਿਰ ਤੇ ਗਿਰ ਘਿਰਾਣ॥ \n' +
//     '    ੭੩ੴੴ ਪਿਛਲਾ ਅਧਿਆਇ ਤਤਕਰਾ ਅੁਤਰਾਰਧ - ਤਤਕਰਾ ਪੂਰਬਾਰਧ ਅਗਲਾ ਅਧਿਆਇ ੴੴ੨ \n' +
//     '                   {ਧ੍ਰਜ਼ਵ ਤੋਣ ਵਿਦਾ} ॥੧੭॥ \n' +
//     '                   {ਸੀਲਾਗਿਰ} ॥੨੭॥ \n' +
//     '                   {ਬ੍ਰਿਛਾਂ ਤੋਣ ਸਿਜ਼ਖਿਆ} ॥੩੫॥ \n' +
//     '                   {ਕਲਾਨ ਅਤੇ ਸੀਲਸੈਨ} ॥੫੫..॥ \n' +
//     '                   {ਗਿਰ ਘਿਰਾਣ} ॥੬੯..॥ \n' +
//     '                   {ਰਿਸ਼ੀ ਲ਼ ਇਸ਼ਨਾਨ ਦਾ ਮਹਾਤਮ ਦਜ਼ਸਂਾ} ॥੭੨..॥ \n' +
//     'ਦੋਹਰਾ: ਸ਼੍ਰੀ ਗੁਰ ਬਚਨ ਸੁ ਚੂਰਨ, ਖਾਇ ਕਮਾਏ ਜਾਣਹਿ  \n' +
//     '         ਅੁਦਰ ਰੋਗ ਹਅੁਮੈਣ ਹਰੋ, ਨਮਸਕਾਰ ਮਮ ਤਾਂਹਿ ॥੧॥ \n' +
//     '     ਸ਼੍ਰੀ ਗੁਰ ਬਚਨ=ਗੁਰੂ ਜੀ ਦੇ ਅੁਚਾਰੇ ਵਾਕ, ਗੁਰਬਾਣੀ \n' +
//     '     ਸੁ=ਚੰਗਾ, ਸਿਜ਼ਧ ਸੁ ਚੂਰਨ=ਅੁਹ ਚੂਰਨ ਜੋ ਨਿਹਚੇ ਰੋਗ ਦੂਰ ਕਰੇ \n' +
//     '     ਅੁਦਰ ਰੋਗ=ਪੇਟ ਦਾ ਰੋਗ \n' +
//     'ਅਰਥ: ਸ਼੍ਰੀ ਗੁਰੂ ਜੀ ਦੀ ਬਾਣੀ ਸਿਜ਼ਧ ਚੂਰਨ (ਦੇ ਸਮਾਨ) ਹੈ, ਜਿਸ ਲ਼ ਖਾਂ (ਰੂਪੀ) ਕਮਾਈ \n' +
//     '         (ਕਰਨ ਨਾਲ) ਹਅੁਮੈਣ (ਰੂਪੀ) ਅੁਦਰ ਰੋਗ ਹਰਿਆ ਜਾਣਦਾ ਹੈ, ਐਸੀ (ਗੁਰਬਾਣੀ ਲ਼) \n' +
//     '         ਮੇਰੀ ਨਮਸਕਾਰ ਹੈ  \n' +
//     'ਭਾਵ:  ਜੇ ਕਦੇ ਜਾਹਿ ਪਦ ਲ਼ ਹਰੋ ਨਾਲ ਜੋੜਕੇ ਹਰੋ ਜਾਹਿ ਪੜ੍ਹਿਆ ਜਾਵੇ ਤਾਂ \n' +
//     '         ਅੁਜ਼ਪਰਲਾ ਅਰਥ ਠੀਕ ਢੁਕਦਾ ਹੈ ਤੇ ਅਜ਼ਗੇ ਸ਼੍ਰੀ ਗੁਰੂ ਨਾਨਕ ਦੇਵ ਜੀ ਦੀ ਅੁਸਤਤ \n' +
//     '         ਚਲਂੀ ਹੈ, ਸੋ ਪਹਿਲਾਂ ਗੁਰਬਾਣੀ ਜੋ ਅਕਾਲ ਪੁਰਖ ਦੀ ਹੋਣ ਕਰਕੇ ਅਕਾਸ਼ ਬਾਣੀ \n' +
//     '         ਦਾ ਦਰਜਾ ਰਖਦੀ ਹੈ, ਅੁਸ ਦਾ ਮੰਗਲ ਫਬਦਾ ਬੀ ਸੁਹਣਾ ਹੈ ਤੇ ਜਾਪਦਾ ਹੈ ਕਿ ਕਵੀ \n' +
//     '         ਜੀ ਦੇ ਸਿਜ਼ਖ ਮਨ ਨੇ ਏਥੇ ਗੁਰਬਾਣੀ ਦੀ ਅਰਾਧਨਾ ਇੰ ਕੀਤੀ ਹੈ ਕਿ ਮਾਨੋਣ ਸਿਜ਼ਖੀ \n' +
//     '         ਦੀ ਸ਼ਾਰਦਾ ਬਾਣੀ ਲ਼ ਮੰਨ ਕੇ ਅੁਸ ਦਾ ਮੰਗਲ ਰੂਪ ਆਵਾਹਨ ਕੀਤਾ ਨੇ, ਤੇ ਓਸ ਲ਼ \n' +
//     '         ਸਾਰੇ ਮੰਗਲਾਂ ਤੋਣ ਏਥੇ ਪਹਿਲਾ ਥਾਂ ਦਿਜ਼ਤਾ ਨੇ  \n' +
//     '\n' +
//     '                                                  \n' +
//     '\u001aਦੇਖੋ ਪੂਰਬਾਰਧ ਪੰਨਾ ੧੨੯ ਸਤਰ ੧੭ ਤੋਣ ਅਜ਼ਗੇ',
//   '੧੨੯੮\n' +
//     '\n' +
//     'ਜੇ ਕਦੇ ਜਾਹਿ ਪਦ ਲ਼ ਸਰਬ ਨਾਮ ਮੰਨੀਏ ਤੇ ਅਰਥ ਕਰੀਏ ਤਾਂ ਅਰਥ ਐਅੁਣ ਢੁਕੇਗਾ ਕਿ \n' +
//     '         ਜਿਸ ਨੇ ਸ਼੍ਰੀ ਗੁਰੂ ਬਾਣੀ (ਰੂਪ) ਸਿਜ਼ਧ ਚੂਰਨ ਲ਼ ਖਾਂ ਦੀ ਕਮਾਈ ਕੀਤੀ ਹੈ (ਤੇ \n' +
//     '         ਐਅੁਣ ਆਪਣਾ) ਹਅੁਮੈ (ਰੂਪੀ) ਰੋਗ ਦੂਰ ਕਰ ਲਿਆ ਹੈ ਅੁਸ ਲ਼ ਮੇਰੀ ਨਮਸਕਾਰ \n' +
//     '         ਹੈ ਤਾਂ ਭਾਵ ਇਹ ਨਿਕਲੇਗਾ ਕਿ ਆਪ ਆਪਣੇ ਵਿਜ਼ਦਾ ਦਾਤਾ ਦਾ ਮੰਗਲ ਕਰ ਰਹੇ \n' +
//     '         ਹਨ, ਜਿਸ ਲ਼ ਅਧਾਯ ੩੪ ਦੇ ਮੰਗਲ ਵਿਚ ਆਪ ਅਜ਼ਗੇ ਜਾਕੇ ਗੁਰਮੁਖ ਪਦ ਨਾਲ \n' +
//     '         ਯਾਦ ਕਰਦੇ ਹਨ  \n' +
//     'ਇਸ  ਦੋਹਰੇ  ਦਾ  ਭਾਵ  ਐਅੁਣ  ਭੀ  ਦਜ਼ਸਦੇ  ਹਨ  ਕਿ:-ਐਸੇ  ਸਤਿਗੁਰੂ  ਜੀ  ਲ਼  ਮੈਣ  ਨਮਸ਼ਕਾਰ \n' +
//     '         ਕਰਦਾ ਹਾਂ ਜਿਨ੍ਹਾਂ ਦੇ ਬਚਨ ਹਅੁਮੈਣ ਰੋਗ ਲ਼ ਕਜ਼ਟਦੇ ਹਨ ਇਹ ਅਰਥ ਕਰਨ ਵਿਚ \n' +
//     '         ਜਾਹਿ ਪਦ ਦਾ ਅਰਥ ਜਿਨ੍ਹਾਂ ਦੇ ਲਗੇਗਾ  \n' +
//     'ਸੈਯਾ:  ਸੇਤੁ ਰਚੋ ਜਗ ਸਾਗਰ ਕੋ \n' +
//     '         ਸਭਿ ਖੰਡ ਪਖੰਡਨ ਸ਼ੋਰ ਸ਼ਰਾਬਾ  \n' +
//     '         ਕੀਰਤਿ ਗਾਇ ਸੁਨੈ ਪ੍ਰਭੂ ਕੀ \n' +
//     '         ਤਨ ਹੰ ਤਜਿਯੇ ਲਖਿ ਰੰਗ ਸ਼ਹਾਬਾ  \n' +
//     '         ਰੰਕ ਧਨੀ ਦੁਖਿ ਪਾਰ ਪਰੈ \n' +
//     '         ਅਵਲੋਕਤਿ ਹੈ ਨਿਜ ਰੂਪ ਅਜਾਬਾ  \n' +
//     '         ਦੇਵਨ ਦੇਵ ਸਦਾ ਪਦ ਸੇਵਹੁ \n' +
//     '         ਗ਼ਾਹਰ ਪੀਰ ਗੁਰੂ ਜਗ ਬਾਬਾ\u001a ॥੨॥ \n' +
//     'ਸੇਤੁ=ਪੁਲ ਸੰਸ: ਸੇਤੁ:॥  \n' +
//     'ਸ਼ਰਾਬਾ=ਰੌਲਾ, ਘਮਸਾਨ ਚੌਦੇਣ, ਜੋ ਪਖੰਡੀਆਣ ਨੇ ਪਾ ਰਜ਼ਖੀ ਸੀ                       \n' +
//     'ਕੀਰਤਿ=ਕੀਰਤੀ ਯਸ਼ੁ, ਵਾਹਿਗੁਰੂ ਦਾ ਗੁਣਾਨੁਵਾਦ, ਸਿਫਤ ਸਲਾਹ, ਕੀਰਤਨ, ਵਾਹਿਗੁਰੂ ਦਾ \n' +
//     'ਜਸ ਗਾਅੁਣਾ ਰਾਗ ਵਿਚ ਸਿਫਤ ਸਲਾਹ ਦਾ ਗਾਅੁਣਾ ਯਾ ਸੁਣਨਾ  \n' +
//     'ਤਨ ਹੰ=ਤਨ ਦੀ ਅਹੰਗਤਾ, ਤਨ ਲ਼ ਆਪਣੇ ਆਪ ਨਾਲ ਅਭੇਦ ਸਮਝਂ ਦੀ ਹਅੁਮੈ  \n' +
//     "                  'ਤਨ ਮੈਣ ਹਾਂ ਰੂਪੀ ਅਵਿਜ਼ਦਾ  \n" +
//     'ਸ਼ਹਾਬਾ=ਕੁਸੰਭਾ, ਕਜ਼ਚਾ ਸੂਹਾ ਰੰਗ ਫਾਰਸੀ, ਸ਼ਹਾਬ=ਲਾਲ ਰੰਗ ਸ਼ਿਹਾਬ=ਅਸਮਾਨ ਵਿਚੋਣ \n' +
//     'ਆਤਸ਼ਬਾਗ਼ੀ ਵਾਣੂੰ ਛੁਟਦਾ ਹੋਇਆ ਸਤਾਰਾ ਅੁਲਕਾਪਾਤ॥  \n' +
//     'ਅਵਲੋਕਤ=ਦੇਖਦੇ ਹਨ  \n' +
//     'ਅਜਾਬਾ=ਅਸਚਰਜ, ਵਿਸਮਾਦ ਅਰਬੀ, ਅਜੀਬ ਯਾ ਅਜੂਬਹ ਤੋਣ ਅਜਾਬਾ॥  \n' +
//     'ਦੇਵਨ ਦੇਵ=ਦੇਵਾਣ ਦੇ ਦੇਵ ਪ੍ਰਕਾਸ਼ ਸਰੂਪਾਂ ਦੇ ਪ੍ਰਕਾਸ਼ ਸਰੂਪ ਗੁਪਤ ਸੰਸਾਰ ਦੀ ਮਹਾਨ \n' +
//     'ਵਕਤੀਆਣ ਤੋਣ ਭੀ ਅੁਜ਼ਚੀ ਵਕਤੀ  \n' +
//     'ਪੀਰ=ਵਜ਼ਡੇ, ਮੁਰਾਦ ਹੈ ਕਲਾਧਾਰੀ ਤੋਣ  \n' +
//     'ਬਾਬਾ=ਸਤਿਕਾਰ ਯੋਗ, ਮੁਰਾਦ ਹੈ ਸ਼੍ਰੀ ਗੁਰੂ ਨਾਨਕ ਦੇਵ ਜੀ ਤੋਣ  \n' +
//     'ਤੁਰਕੀ, ਬਾਬਾ=ਪਿਤਾ॥  \n' +
//     '\n' +
//     '                                                 \n' +
//     '\u001aਕਵਿ ਜੀ ਨੇ ਭਾਈ ਸਾਹਿਬ ਭਾਈ ਗੁਰਦਾਸ ਜੀ ਦੀ ਚੌਵੀਵੀਣ ਵਾਰ ਵਿਖੇ ਤੀਜੀ ਚੌਥੀ ਪੌੜੀ ਦੀ ਅੰਤਲੀ ਤੁਕ \n' +
//     'ਗ਼ਾਹਰ ਪੀਰ ਜਗਤ ਗੁਰ ਬਾਬਾ ਦੀ ਸਮਜ਼ਸਾ ਤੇ ਇਹ ਮੰਗਲ ਕੀਤਾ ਹੈ',
//   '੧੨੯੯\n' +
//     '\n' +
//     'ਅਰਥ: ਦੇਵਾਣ ਦੇ ਦੇਵ, ਜਗਤ ਦੇ ਗੁਰੂ, ਗ਼ਾਹਰਾ ਕਲਾਧਾਰੀ, ਸ਼੍ਰੀ ਗੁਰੂ ਨਾਨਕ ਦੇਵ ਜੀ ਦੇ \n' +
//     '         ਚਰਣਾਂ ਲ਼ ਸਦਾ ਸੇਵੋ, (ਜਿਨ੍ਹਾਂ ਨੇ) ਜਗਤ (ਦੇ ਦੁਖ ਰੂਪੀ) ਸਮੁੰਦਰ (ਤੋਣ ਪਾਰ ਕਰਨ \n' +
//     '         ਲਈ ਪ੍ਰਭੂ ਦੀ ਕੀਰਤੀ ਰੂਪ) ਪੁਲ ਰਚ ਦਿਜ਼ਤਾ ਹੈ, ਸਾਰੇ ਪਖੰਡਾਂ ਦਾ ਸ਼ੋਰ ਸ਼ਰਾਬਾ \n' +
//     '         ਮੇਟਕੇ (ਸੋ ਹੁਣ ਅਸੀਣ) ਵਾਹਿਗੁਰੂ ਦੀ ਕੀਰਤੀ ਸੁਣ ਕੇ (ਅਥਵਾ) ਗਾਅੁਣਕੇ, ਤਨ \n' +
//     '         ਦੀ  ਹਅੁਣ  ਲ਼  ਕੁਸੰਭੇ  ਦਾ  ਰੰਗ  ਸਮਝਕੇ  ਤਿਆਗ  ਦੇਈਏ  (ਕਿਅੁਣਕਿ  ਓਹ  ਕੀਰਤਨ \n' +
//     '         ਐਸਾ ਨਿਸ਼ਚੇ ਪਾਰ ਕਰਨੇ ਵਾਲਾ ਪੁਲ ਹੈ ਕਿ ਜਿਸ ਦਾਰਾ) ਗਰੀਬ ਅਮੀਰ (ਸਜ਼ਭੇ) \n' +
//     '         ਦੁਖ (ਸਾਗਰ) ਤੋਣ ਪਾਰ ਹੋਕੇ ਆਪਣੇ ਵਿਸਮਾਦ ਸਰੂਪ ਲ਼ ਵੇਖ ਲੈਣਦੇ ਹਨ  \n' +
//     '         ਮਤਿ ਮੰਦਿ ਭਏ ਕਲਿ ਮੈਣ ਨਰ, ਰੰਗ \n' +
//     '         ਦਯੋ ਹਰਨਾਮ ਤਿਨੈ ਮਨ ਮਾਨਕ  \n' +
//     '         ਤਨ ਮਾਨ ਤਜੇ ਸਿਮਰੇ ਜਿ ਸਦਾ \n' +
//     '         ਪ੍ਰਗਟੇ ਘਟ ਅੰਤਰ ਗਾਨ ਅਚਾਨਕ  \n' +
//     '         ਲਖਿ ਕੂਰ ਪਦਾਰਥ ਕੇ ਤਜਿ ਸਾਰਥ \n' +
//     '         ਭੇ ਪਰਮਾਰਥ ਮੈਣ ਦੁਖ ਹਾਨਕ  \n' +
//     '         ਗੁਨ ਬ੍ਰਿੰਦ ਗਹੀਰ ਸਰੀਰ ਧਰੋ ਬਰ \n' +
//     '         ਜਾਹਰ ਪੀਰ ਗੁਰੂ ਜਗ ਨਾਨਕ ॥੩॥ \n' +
//     '         ਮਨ  ਮਾਨਕ=ਮਨ  ਦਾ  ਮਾਂਿਕ,  ਹੀਰੇ ਲਾਲ  ਪੰਨੇ  ਆਦਿ  ਤਾਂ ਜਗਤ  ਵਿਚ ਮਾਂਿਕ \n' +
//     'ਹਨ, ਅਜ਼ਖਾਂ ਲ਼ ਪਿਆਰੇ ਲਗਦੇ ਹਨ, ਪਰ ਹਰਨਾਮ ਮਨ ਦਾ ਮਾਂਕ ਹੈ ਜੋ ਹ੍ਰਿਦਯ ਵਿਚ \n' +
//     'ਜਾ ਕੇ ਅੁਸ ਲ਼ ਅਮੋਲਕ ਕਰ ਦੇਣਦਾ ਹੈ (ਅ) ਮਨ ਵਿਚ ਮਾਂਿਕ ਦਿਜ਼ਤਾ-ਐਅੁਣ ਭੀ ਲਾਅੁਣਦੇ \n' +
//     'ਹਨ (ੲ) ਮਣਿ ਮਾਂਿਕ=ਮਾਂਿਕ ਮਣੀ ਵਾਣ  \n' +
//     'ਤਨ ਮਾਨ=ਤਨ ਦਾ ਮਾਨ ਆਪਣੇ ਸਰੀਰ ਦੇ ਸੁੰਦਰ, ਬਲਵਾਨ ਹੋਣ ਦਾ ਮਾਂ (ਅ) ਮਨ ਲ਼ \n' +
//     'ਆਤਮਾਂ ਦੇ ਤੁਜ਼ਲ ਮਾਪ ਲੈਂ ਦਾ ਅੰਧੇਰਾ ਯਾ ਅਵਿਜ਼ਦਾ ਕੂਰ=ਕੂੜੇ, ਝੂਠੇ ਬ੍ਰਿੰਦ=ਸਮੂਹ  \n' +
//     'ਗਹੀਰ=ਜੋ ਗਹਿਰਾ ਹੋਵੇ, ਸਮੁੰਦਰ  \n' +
//     'ਪੀਰ=ਵੇਖੋ ਪਿਛਲੇ ਸਯੇ ਦੇ ਪਦਾਂ ਦੇ ਅਰਥਾਂ ਵਿਜ਼ਚ  \n' +
//     'ਅਰਥ: (ਅੁਸ ਸ਼੍ਰੀ ਗੁਰੂ ਨਾਨਕ ਨੇ) ਕਲਜੁਗ ਵਿਚ ਜੋ ਲੋਕ ਖੋਟੀ ਬੁਜ਼ਧੀ ਵਾਲੇ ਹੋਕੇ (ਸ਼ੁਭ \n' +
//     '         ਗੁਣਾਂ ਵਿਚ) ਕੰਗਾਲ ਹੋਏ ਸਨ (ਤਿਨ੍ਹਾਂ ਲ਼) ਹਰੀ ਦਾ ਨਾਮ ਮਨ ਦਾ ਮਾਂਕ ਦਾਨ \n' +
//     '         ਕੀਤਾ,  ਜਿਨ੍ਹਾਂ  ਨੇ  (ਇਹ  ਪ੍ਰਾਪਤ  ਕਰਕੇ)  ਸਦਾ  ਸਿਮਰਿਆ  (ਅੁਨ੍ਹਾਂ  ਨੇ)  ਸਰੀਰ  ਦੇ \n' +
//     '         ਮਾਨ ਲ਼ ਦੂਰ ਕਰ ਲਿਆ, (ਅੁਨ੍ਹਾਂ ਦੇ) ਹਿਰਦੇ ਵਿਚ ਅਚਾਨਕ ਗਿਆਨ ਪ੍ਰਗਟ ਹੋ \n' +
//     '         ਗਿਆ  ਪਦਾਰਥਾਂ  ਲ਼  ਝੂਠਾ  ਲਖਕੇ  (ਅੁਨ੍ਹਾਂ  ਨੇ)  ਸਵਾਰਥ  ਛਜ਼ਡ  ਦਿਤੇ  (ਤੇ  ਐਅੁਣ) \n' +
//     '         ਪਰਮਾਰਥ ਵਿਚ ਦੁਖ ਦੂਰ ਕਰਨ ਵਾਲੇ ਹੋ ਗਏ ਗ਼ਾਹਰਾ ਕਲਾਧਾਰੀ ਜਗਤ ਦੇ ਗੁਰੂ \n' +
//     '         (ਸ਼੍ਰੀ ਗੁਰੂ) ਨਾਨਕ ਨੇ (ਐਸਾ) ਸ੍ਰੇਸ਼ਟ ਤੇ ਸਾਰੇ ਗੁਣਾਂ ਦਾ ਸਮੁੰਦਰ ਸਰੀਰ ਧਾਰਨ \n' +
//     '         ਕੀਤਾ  \n' +
//     '         ਸ਼੍ਰੀ ਬਾਲਾ ਸੰਧੁਰੁ ਵਾਚ ॥ \n' +
//     'ਚੌਪਈ: ਸ਼੍ਰੀ ਕਰਤਾਰ ਪੁਰਖ ਦੁਖ ਗੰਜਨ੧  \n' +
//     '         ਭਗਤਨਿ ਕੇਰ ਸਦਾ ਮਨ ਰੰਜਨ੧  \n' +
//     '\n' +
//     '                                                \n' +
//     '੧ਦੁਖ ਨਾਸ਼ ਕਰਨ ਵਾਲੇ',
//   '੧੩੦੦\n' +
//     '\n' +
//     '           ਤਿਨ ਤੇ ਬਿਦਾ ਹੋਇ ਹਟਿ\u001a ਆਏ  \n' +
//     '           ਜਗਤ ਗੁਰੂ ਸਿਜ਼ਖਨ ਸੁਖਦਾਏ ॥੪॥ \n' +
//     '           ਸ਼੍ਰੀ ਅੰਗਦ ਸੁਨੀਏ ਇਤਿਹਾਸਾ  \n' +
//     '           ਹਮਰੇ ਢਿਗ ਆਏ ਸੁਖਰਾਸਾ੨  \n' +
//     '           ਧ੍ਰਵ ਮੰਡਲ ਜੋ ਹੁਤੋ ਸੁਹਾਵਾ  \n' +
//     '           ਤਹਿਣ ਤੇ ਹਮ ਕੋ ਸੰਗ ਰਲਾਵਾ ॥੫॥ \n' +
//     '           ਧ੍ਰ ਅਵਲੋਕੇ ਆਵਤਿ ਜਬ ਹੀ  \n' +
//     '           ਨਮੋ ਪਰਸਪਰ ਕਿਯ ਮਿਲਿ ਤਬ ਹੀ  \n' +
//     '           ਬੂਝਨ ਲਗੋ ਪਤੇ ਪੁਨ ਸੋਅੂ  \n' +
//     '           ਜਹਾਂ ਨ ਪਹੁਣਚਿ ਸਕੋ ਕਬ੩ ਕੋਅੂ ॥੬॥ \n' +
//     '           ਸਜ਼ਚ ਖੰਡ ਕੀ ਦੇਹੁ ਨਿਸ਼ਾਨੀ  \n' +
//     '           ਕੈਸਾ ਦੇਖੋ ਪ੍ਰਭੁ ਨਿਰਬਾਨੀ੪?  \n' +
//     '           ਕੌਨੈ ਰੂਪ ਰੰਗ ਹੈ ਤਿਨ ਕੋ?  \n' +
//     '           ਦਰਸ਼ਨ ਜਾਇ ਕੀਨ ਤੁਮ ਜਿਨ ਕੋ ॥੭॥ \n' +
//     '           ਆਗੈ ਭਈ ਨ ਕਬ ਹੀ ਐਸੇ  \n' +
//     '           ਦੇਹਿ ਸਮੇਤ ਗਏ ਢਿਗ ਜੈਸੇ                                                  ਵਿਸ਼ੇਸ਼ ਟੂਕ ੧ \n' +
//     '           ੫ਅੁਜ਼ਤਮ ਭਗਤ ਧ੍ਰਜ਼ਵ ਤੁਮ ਸੁਨੀਏ  \n' +
//     '           ਰੂਪ ਰੰਗ ਤਿਨ ਕੋ ਨਹਿਣ ਗੁਨੀਏ੬* ॥੮॥ \n' +
//     '           ਭਗਤਨਿ ਧਾਨ ਹੇਤ ਬਿਨ ਜੌਨਾ੭   \n' +
//     '           ਸੋਹਤਿ ਸ਼ਾਮ ਸਰੂਪ ਸਲੋਨਾ੮  \n' +
//     '           ਸਸਿ੯ ਸਵਿਤਾ੧੦ ਕੋਟਿਕ੧ ਅੁਜਿਆਰਾ੨  \n' +
//     '\n' +
//     '                                                                                                                        \n' +
//     '੧ਮਨ ਪ੍ਰਸੰਨ ਕਰਨ ਵਾਲੇ  \n' +
//     "\u001aਪਾ:-'ਕਰ, ਤਬ'  \n" +
//     '੨ਸੁਖਾਂ ਦੀ ਰਾਸ ਭਾਵ ਸਤਿਗੁਰੂ ਜੀ  \n' +
//     '੩ਕਦੇ ਬੀ  \n' +
//     '੪ਜੋ ਕਦੇ ਕਲੇਸ਼ ਕਰਮ ਜਨਮ ਵਿਚ ਨਾ ਆਯਾ ਹੋਵੇ, ਸ਼ੁਜ਼ਧ  \n' +
//     '੫ਗੁਰੂ ਜੀ ਬੋਲੇ  \n' +
//     '੬ਜਾਣਿਆਣ ਜਾਣਦਾ  \n' +
//     '*ਪਾ:-ਨਹਿ ਜਨੀਯੇ  \n' +
//     '੭ਜੋ ਜੂਨ ਵਿਚ ਆਏ ਤੋਣ ਬਿਨਾਂ ਯਾ ਕਿਸੇ ਕਲੇਸ਼ ਕਰਮ ਕਾਰਣ ਤੇ ਸਦਾ ਸੁਤੰਤਰ ਰਹਿਕੇ ਭਗਤਾਂ ਦੇ ਧਾਨ \n' +
//     'ਹਿਤ ਰੂਪ ਹੈ, ਅੁਹ.....  \n' +
//     ' ਪਾ:-ਭਗਤਨ ਧਾਨ ਹੇਤ ਮਨ ਜੌਨਾ ਅਰਥਾਤ-ਜੇਹੜੀ ਭਗਤਾਂ ਦੇ ਮਨ ਦੇ ਧਾਨ ਮਾਤ੍ਰ ਲਈ ਹੈ  \n' +
//     '੮ਸੁੰਦਰ  \n' +
//     '੯ਚੰਦਰਮਾ  \n' +
//     '੧੦ਸੂਰਜ',
//   '੧੩੦੧\n' +
//     '\n' +
//     '           ਬ੍ਰਹਮਾਦਿਕ ਜਿਹ ਪਾਇਣ ਨ ਪਾਰਾ ॥੯॥ \n' +
//     '           ਕੋਟਿ ਕਾਮ ਕੀ੩ ਸੁੰਦਰਤਾਈ  \n' +
//     '           ਇਕ ਨਖ ਕੀ ਨ ਕਰੇ ਸਮਤਾਈ੪  \n' +
//     '           ਕੋ ਅੁਪਮਾ ਮੈਣ ਦੇਵੋਣ ਤਿਨ ਕੀ  \n' +
//     '           ਸਰਬਰ ਕੋਇ ਨ ਦੇਖੌਣ ਜਿਨ ਕੀ ॥੧੦॥ \n' +
//     '           ਅਨਿਕ ਬ੍ਰਹਮੰਡ ਦੇਹਿ ਮਹਿਣ ਬਨੇ  \n' +
//     '           ਜਿਅੁਣ ਤਰੁਵਰ੫ ਬਹੁ ਫਲ ਕੇ ਸਨੇ  \n' +
//     '           ਕਹਿਨ ਸੁਨਨਿ ਤੇ ਜਾਨਿ ਅਨਤਾ੬  \n' +
//     '           ਨਿਖਲ੭ ਭਵਨ੮ ਕੋ ਰਾਜਤਿ ਕੰਤਾ੯ ॥੧੧॥ \n' +
//     '           ਸਭਿਨਿ ਬਿਖੈ ਜਿਹ ਜੋਤਿ ਸਮਾਨੀ੧੦  \n' +
//     '           ਸਦਾ ਅਲੇਪ ਸਰਬ ਕੋ ਦਾਨੀ  \n' +
//     '           ਸੁਨਿ ਕੀਨੋ ਧ੍ਰਵ ਹਰਖ ਅਪਾਰਾ  \n' +
//     '           ਨਿਰੰਕਾਰ ਕੇ ਤੁਮ ਆਕਾਰਾ੧੧ ॥੧੨॥ \n' +
//     '           ਨਿਸ਼ਚਾ ਮੋਹਿ ਅਧਿਕ ਅਤਿ ਗਾਢੋ  \n' +
//     '           ਧੰਨ ਭਾਗ ਦੇਖੋ ਢਿਗ ਠਾਂਢੋ੧੨  \n' +
//     '           ਕਲਿ੧੩ ਮਹਿਣ ਨਾਮ ਕਰਹਿਣ ਅੁਪਦੇਸਾ  \n' +
//     '           ਪਾਵਤਿ ਨਰ ਜੇ ਅਧਿਕ ਕਲੇਸ਼ਾ ॥੧੩॥ \n' +
//     '           ਸਹਿ ਨ ਸਕੇ ਤਿਨ ਕੋ ਦੁਖ ਭਾਰੀ  \n' +
//     '           ਧਰੋ ਰੂਪ ਤੁਮ ਪਰਅੁਪਕਾਰੀ  \n' +
//     '           ਦੀਨ ਬੁੰਧ ਹੋ ਦੀਨ ਦਯਾਲਾ  \n' +
//     '           ਦੀਨਾ ਨਾਥਹਿ ਨਾਮ ਬਿਸਾਲਾ ॥੧੪॥ \n' +
//     '           ਅੁਸਤਤਿ ਕੇ ਬਚਿ ਇਅੁਣ ਕਹਿ ਸੁਨਿ ਕੈ  \n' +
//     '\n' +
//     '                                                                                                                        \n' +
//     '੧ਕ੍ਰੋੜਾਂ ਹੀ  \n' +
//     '੨ਪ੍ਰਕਾਸ਼  \n' +
//     '੩ਕਾਮਦੇਵਾਣ ਦੀ  \n' +
//     '੪ਬਰਾਬਰੀ  \n' +
//     '੫ਬ੍ਰਿਜ਼ਛ  \n' +
//     '੬ਬੇਅੰਤ  \n' +
//     '੭ਸਾਰੇ  \n' +
//     '੮ਲੋਕਾਣ  \n' +
//     '੯ਸਾਮੀ  \n' +
//     '੧੦ਸਮਾਈ ਹੋਈ ਹੈ  \n' +
//     '੧੧ਸਰੂਪ  \n' +
//     '੧੨ਪਾਸ ਖੜਾ ਹੋਕੇ  \n' +
//     '੧੩ਕਲਯੁਗ',
//   '੧੩੦੨\n' +
//     '\n' +
//     '           ਬੈਸੇ ਕਿਤਿਕ ਕਾਲ ਜਨ ਗੁਨਿ ਕੈ੧  \n' +
//     '           ਬੋਲੇ ਬਹੁਰ ਸੁਨੋ ਧ੍ਰਵ ਪਾਰੇ!  \n' +
//     '           ਅਬ ਚਲਿਨੇ ਕੀ ਚਾਹਿ ਹਮਾਰੇ ॥੧੫॥ \n' +
//     '           ਕਰਨੇ ਕਾਜ ਜਾਇ ਤਲ ਛੋਨੀ੨  \n' +
//     '           ਆਇਸੁ ਦਿਹੁ ਤਵ ਕੀਰਤਿ ਨੋਨੀ  \n' +
//     '           ਧ੍ਰਵ ਸੁਨਿ ਕੈ ਇਵ ਬਚਨ ਅੁਚਾਰਾ  \n' +
//     '           ਆਇਸੁ ਸਦਾ ਤੁਮਹਿਣ ਕਰਤਾਰਾ ॥੧੬॥ \n' +
//     '           ਬਿਚਰਅੁ ਜਹਿਣ ਇਜ਼ਛਾ ਅੁਰ ਤੇਰੇ  \n' +
//     '           ਕਲਮਲ ਨਾਸਹਿਣ ਦਰਸ਼ਨ ਹੇਰੇ  \n' +
//     '           ਕਰੀ ਪਰਸਪਰ ਤਬ ਹੀ ਬੰਦਨ                                          {ਧ੍ਰਜ਼ਵ ਤੋਣ ਵਿਦਾ} \n' +
//     '           ਤਹਿਣ ਤੇ ਗਮਨੇ ਦੋਖ ਨਿਕੰਦਨ ॥੧੭॥ \n' +
//     '           ਕਿਤਿਕ ਦੂਰ ਤਬ ਹੀ ਚਲਿ ਆਏ  \n' +
//     '           ਮਰਦਾਨੇ ਤਬ ਬੈਨ ਅਲਾਏ  \n' +
//     '           ਜੇਤੇ ਨਭਚਰ੩ ਹੈਣ ਨਭਿ ਮਾਂਹੀ  \n' +
//     '           ਧ੍ਰਵ ਮੰਡਲ ਸਭਿ ਤੇ ਅੁਰਧਾਹੀ੪ ॥੧੮॥ \n' +
//     '           ਭੂਤਲ੫ ਤੇ ਅੂਰਧ੬ ਹੈ ਜੇਤੋ  \n' +
//     '           ਮੁਝੈ ਬਤਾਵੋ ਸ਼੍ਰੀ ਪ੍ਰਭੁ ਤੇਤੋ  \n' +
//     '           ਹਮ ਸੇ ਅਲਪਨ੭ ਕੋ ਇਹ ਥਾਨਾਂ  \n' +
//     '           ਤੁਮ ਬਿਨ ਕੌਨ ਦਿਖਾਇ, ਮਹਾਨਾਂ੮ ॥੧੯॥ \n' +
//     '           ਸ਼੍ਰੀ ਗੁਰ ਕਹੈਣ ਸੁਨੋ ਮਰਦਾਨੇ  \n' +
//     '           ਧ੍ਰਵ ਮੰਡਲ ਜੇਤੋਕ ਪ੍ਰਮਾਨੇ  \n' +
//     '           ਅੁਣਤਾਲੀ ਲਖ ਜੋਜਨ ਅੂਚਾ*  \n' +
//     '           ਇਸਕੀ ਸਰਬਰ੯ ਕੋ ਨ ਪਹੂਚਾ ॥੨੦॥ \n' +
//     '\n' +
//     '                                                    \n' +
//     '੧(ਧ੍ਰ ਲ਼) ਦਾਸ ਜਾਣਕੇ  \n' +
//     '੨ਹੇਠਾਂ ਧਰਤੀ ਤੇ  \n' +
//     '੩ਅਕਾਸ਼ ਤੇ ਵਿਚਰਨ ਵਾਲੇ  \n' +
//     '੪ਅੁਜ਼ਚਾ ਹੈ  \n' +
//     '੫ਪ੍ਰਿਥਵੀ  \n' +
//     '੬ਅੁਚਾ  \n' +
//     '੭ਸਾਡੇ ਵਰਗੇ ਤੁਜ਼ਛਾਂ  \n' +
//     '੮ਹੇ ਸ੍ਰੇਸ਼ਟ ਜੀਓ!  \n' +
//     '* ਏਹ ਹਿਸਾਬ ਵੀ ਹਿੰਦਾਲਿਆਣ ਦੀ ਵਿਗਾੜੀ ਹੋਈ ਜਨਮਸਾਖੀ ਤੋਣ ਹੀ ਲਿਖੇ ਜਾਪਦੇ ਹਨ ਧ੍ਰ ਨਾਮੇ \n' +
//     'ਸਿਤਾਰਾ ਇਸ ਤੋਣ ਬਹੁਤ ਹੀ ਵਧੀਕ ਦੂਰੀ ਤੇ ਹੈ  \n' +
//     '੯ਬਰਾਬਰ',
//   '੧੩੦੩\n' +
//     '\n' +
//     '           ਪ੍ਰਭੁ ਜੀ ਮੁਝ ਇਕ ਅਵਰ ਬਤਾਵਅੁ  \n' +
//     '           ਲਖਿ ਅਜਾਨ ਨਹਿਣ ਮਨ ਖੁਨਸਾਵਅੁ  \n' +
//     '           ਧ੍ਰਵ ਮੰਡਲ ਤੇ ਗਏ ਅਗਾਰੀ੧  \n' +
//     '           ਕੇਤੀ ਦੂਰ? ਕਹਅੁ ਸੁਖਕਾਰੀ! ॥੨੧॥ \n' +
//     '           ਅਜ਼ਪ੍ਰਮਾਨ੨ ਸੋ ਸੁਨਿ ਮਰਦਾਨੇ  \n' +
//     '           ਤਿਹ ਕੀ ਗਿਨਤੀ ਹੈ ਨ ਬਖਾਨੇ  \n' +
//     '           ਨਾਮ ਅਨਤ ਅਲੇਖ ਅਪਾਰਾ  \n' +
//     '           ਬ੍ਰਹਮਾਦਿਕ ਇਅੁਣ ਕਰਤਿ ਅੁਚਾਰਾ੩ ॥੨੨॥ \n' +
//     '           ਦਯਾ ਧਾਰਿ ਦਿਖਰਾਵਹਿ੪ ਜੇਤੋ੫  \n' +
//     '           ਕਰੋ ਜੰਤੁ੬ ਦੇਖਤਿ ਹੈ ਤੇਤੋ  \n' +
//     '           ਓਰਕ ਕਹੂੰ ਨ ਪਾਯੋ ਕਾਣਹੂ  \n' +
//     '           ਸਰਬ ਅਨਤ੭ ਕਹੈਣ ਮਿਲਿ ਤਾਂਹੂ ॥੨੩॥ \n' +
//     '           ਧੰਨ! ਧੰਨ! ਭਾਖੈ ਮਰਦਾਨਾ  \n' +
//     '           ਕਹਅੁ ਸਜ਼ਤਿ ਤੁਮ ਮਯਾ ਨਿਧਾਨਾ!  \n' +
//     '           ਨਿਰੰਕਾਰ ਤੁਮ ਮਹਿਣ ਨਹਿਣ ਭੇਦਾ  \n' +
//     '           ਕਾਰਨ ਕਰਨ੮ ਅਕਾਲ ਅਛੇਦਾ ॥੨੪॥ \n' +
//     '           ਅਬ ਭੂਤਲ ਕੋ ਆਪ ਪਧਾਰੇ  \n' +
//     '           ਕੌਨ ਦੇਸ਼ ਆਇ ਪੰਥ ਅਗਾਰੇ?  \n' +
//     '           ਕਿਤਿਕ ਦੇਰ ਮਹਿਣ ਚਲਹਿ ਗੁਸਾਈਣ?  \n' +
//     '           ਸੁਨਿ ਕਰਿ ਸ਼੍ਰੀ ਗੁਰ ਗਿਰਾ ਅਲਾਈ ॥੨੫॥ \n' +
//     'ਦੋਹਰਾ: ਸੂਰਤ ਬੰਦਰ ਆਵਈ,  \n' +
//     '           ਨਟਕਾ ਚਪਟਾ ਫੇਰ \n' +
//     '           ਮਛਲੀ ਬੰਦਰ ਜਾਇਣ ਪੁਨਿ,  \n' +
//     '           ਸ਼ੀਘਰ ਕਰੈਣ ਨ ਦੇਰ ॥੨੬ ॥                                                    ਵਿਸ਼ੇਸ਼ ਟੂਕ ੨ \n' +
//     'ਚੌਪਈ: ਇਸ ਪ੍ਰਕਾਰ ਕੇ ਬਚਨ ਬਿਲਾਸਾ  \n' +
//     '\n' +
//     '                                                    \n' +
//     '੧ਅਜ਼ਗੇ  \n' +
//     '੨ਬੇਅੰਦਾਗ਼ਾ  \n' +
//     '੩ਪਾਰਾਵਾਰ ਰਹਿਤ  \n' +
//     '੪ਦਿਖਾਂਵਦਾ ਹੈ  \n' +
//     '੫ਜਿਤਨਾ  \n' +
//     '੬ਕੀਤਾ ਹੋਯਾ ਜੀਵ  \n' +
//     '੭ਬਿਅੰਤ ਹੀ  \n' +
//     '੮ਸਬਜ਼ਬਾਣ ਦੇ ਕਰਨ ਵਾਲੇ',
//   '੧੩੦੪\n' +
//     '\n' +
//     '           ਕਰਤਿ ਚਲਤਿ ਸਿਜ਼ਖਨ ਸੁਖ ਰਾਸਾ  \n' +
//     '           ਸੀਲਾਗਿਰ੧ ਪਰ ਜਬ ਚਲਿ ਆਏ  \n' +
//     '           ਮਰਦਾਨੇ ਤਬ ਬੈਨ ਅਲਾਏ ॥੨੭॥                                                  {ਸੀਲਾਗਿਰ} \n' +
//     '           ਇਸ ਪਰਬਤ ਸੁੰਦਰ ਕੇ ਮਾਂਹੀ  \n' +
//     '           ਰਹਤਿ ਸੰਤ ਕੈਧੌਣ ਕੋ ਨਾਂਹੀ?  \n' +
//     '           ਪਸੁ ਪੰਖੀ ਕੋ ਨਗ਼ਰ ਨ ਆਵੈ  \n' +
//     '           ਸੂਨੋ੨ ਸਭਿ ਇਸਥਾਨ ਦਿਖਾਵੈ ॥੨੮॥ \n' +
//     '           ਸ਼੍ਰੀ ਗੁਰ ਕਹੈਣ ਛੁਧਾ ਤੁਹਿ ਲਾਗੀ  \n' +
//     '           ਕਿਅੁਣ ਕਰਿ ਬੂਝਤਿ ਹੈ ਬਡਿਭਾਗੀ? \n' +
//     '           ਇਸ ਗਿਰਪਰ ਨਰ ਰਹਿਤਿ ਨ ਕੋਅੂ  \n' +
//     '           ਅਗਲੋ ਥਲ ਅਵਲੋਕਤਿ ਜੋਅੂ ॥੨੯॥ \n' +
//     '           ਤਿਹ ਪਰ ਰਹਿਤ ਰਿਖੀਸ਼ੁਰ ਭੂਰੰ੩  \n' +
//     '           ਤਰੁਵਰ੪ ਬਹੁ ਲਾਗੇ ਫਲ ਰੂਰੰ  \n' +
//     '           ਜੇਕਰਿ ਤਵ ਮਨ ਮੈਣ ਹੈ ਚਾਹੀ  \n' +
//     '           ਚਲਿ ਕਰਿ ਤਹਿਣ ਫਲ ਲੀਜੈ ਖਾਹੀ ॥੩੦॥ \n' +
//     '           ਸ੍ਰੀ ਪ੍ਰਭੁ! ਸੁਨੀਏ ਛੁਧਾ ਨ ਕੋਈ  \n' +
//     '           ਜਬ ਕੋ ਬਰ ਦੇ ਕਰਿ ਤੁਮ ਖੋਈ  \n' +
//     '           ਰਹੋਣ ਅਨਦ ਸਦਾ ਅੁਰ ਮਾਂਹੀ  \n' +
//     '           ਖਾਵਨ ਚਾਹਿ ਹੋਤਿ ਕਬਿ ਨਾਂਹੀ ॥੩੧॥ \n' +
//     '           ਕਹਿਤਿ ਸੁਨਤਿ ਤਿਹ ਗਿਰ ਪਰ ਆਏ  \n' +
//     '           ਜਹਾਂ ਬਿਟਪ੫ ਫਲ ਸਹਿਤ ਸੁਹਾਏ  \n' +
//     '           ਅਨਿਕ ਰੰਗ ਕੇ ਸੁਮਨ੬ ਸੁਹਾਵਨ  \n' +
//     '           ਜਿਨ ਪਰ ਭੌਰੇ ਕਰਹਿਣ ਭ੍ਰਮਾਵਨ੭ ॥੩੨॥ \n' +
//     '           ਲਤਾ੮ ਬਹੁਤ ਜਿਨ ਸੋਣ ਅੁਰਝਾਨੀ  \n' +
//     '           ਸੁੰਦਰ ਅਤਿ ਛਾਇਆ ਸੁਖਦਾਨੀ  \n' +
//     '\n' +
//     '                                                    \n' +
//     '੧ਨਾਮ ਹੈ ਪਹਾੜ ਦਾ  \n' +
//     '੨ਸੁੰਾ  \n' +
//     '੩ਬਹੁਤੇ  \n' +
//     '੪ਬ੍ਰਿਜ਼ਛਾਂ ਲ਼  \n' +
//     '੫ਬ੍ਰਿਜ਼ਛ  \n' +
//     '੬ਵਜ਼ਲ  \n' +
//     '੭ਅੁਡਂਾ  \n' +
//     '੮ਵੇਲਾਂ',
//   '੧੩੦੫\n' +
//     '\n' +
//     '           ਅਨਿਕ ਬਿਧਿਨਿ ਲਾਗੇ ਫਲ ਸਰਸੰ੧  \n' +
//     '           ਸ਼ਾਖਾ੨ ਭਾਰ ਭੂਮਿ ਸੋਣ ਪਰਸੰ੩ ॥੩੩॥ \n' +
//     '           ਮਨਹੁ ਅਥਿਤ੪ ਜੋ ਆਵਤਿ ਪਾਸਾ  \n' +
//     '           ਦੇਨੇ ਹੇਤ ਝੁਕੇ ਫਲ ਰਾਸਾ੫  \n' +
//     '           ਬਿਨ ਹੀ ਸ਼੍ਰਮ੬ ਲੇਣ ਤੋਰ ਸੁਖਾਰੇ  \n' +
//     '           ਖਾਵਹਿਣ ਸਾਦੁ੭ ਛੁਧਾ ਨਿਰਵਾਰੇ ॥੩੪॥ \n' +
//     'ਦੋਹਰਾ: ਅੁਪਕਾਰੀ ਜੋ ਪੁਰਖ ਹੈਣ,  \n' +
//     '           ਸਿਜ਼ਖਾ ਤਿਹ ਜਨੁ ਦੇਤਿ                                           {ਬ੍ਰਿਛਾਂ ਤੋਣ ਸਿਜ਼ਖਿਆ} \n' +
//     '           -ਕਰਿ ਅੁਪਕਾਰ ਸੁ ਨਿਵ ਚਲੋ,  \n' +
//     '           ਦੀਨ ਦੁਨੀ ਸੁਖ ਹੇਤ- ॥੩੫॥ \n' +
//     'ਚੌਪਈ: ਸੀਤਲ ਬਿਮਲ੮ ਨੌਰਾ੯* ਨੀਰੰ੧੦  \n' +
//     '           ਮਾਰਗਸ਼੍ਰਮ ਕੀ੧੧ ਖੋਵਤਿ ਪੀਰੰ  \n' +
//     '           ਸਘਨ੧੨ ਸੁਹਾਵਨ ਛਾਯਾ ਜਹਿਣਵਾ  \n' +
//     '           ਬੈਸੇ ਸ਼੍ਰੀ ਨਾਨਕ ਪਿਖਿ ਤਹਿਣਵਾ ॥੩੬॥ \n' +
//     '           ਬਰ ਫਰ੧੩ ਮਧੁਰ ਤੋਰਿ ਮਰਦਾਨੇ  \n' +
//     '           ਗੁਰ ਅਜ਼ਗ੍ਰਜ ਰਾਖੇ ਤਬਿ ਆਨੇ  \n' +
//     '           ਸੁੰਦਰ ਸਰਸ੧੪ ਦੇਖਿ ਮਨ ਭਾਏ  \n' +
//     '           ਸ਼੍ਰੀ ਗੁਰ ਕਰ ਮੈਣ ਅਰਧ ਅੁਠਾਏ ॥੩੭॥ \n' +
//     '           ਸੋ ਮੋ ਕੋ ਦੀਨੇ ਤਿਹ ਕਾਲਾ  \n' +
//     '           ਰਾਖੇ ਅਰਧੰ ਆਪ ਕ੍ਰਿਪਾਲਾ  \n' +
//     '\n' +
//     '                                                    \n' +
//     '੧ਰਸਾਂ ਵਾਲੇ  \n' +
//     '੨ਟਾਹਣੀਆਣ  \n' +
//     '੩ਛੋਣਹਦੀਆਣ ਹਨ  \n' +
//     '੪ਲੋੜਵੰਦ  \n' +
//     '੫ਸਾਰੇ  \n' +
//     '੬ਬਿਨਾ ਖੇਚਲ ਦੇ  \n' +
//     '੭ਸਵਾਦ ਨਾਲ  \n' +
//     '੮ਅੁਜ਼ਜਲ  \n' +
//     '੯ਪਰਵਾਹ ਦਾ  \n' +
//     '* ਪਾ:-ਪੀਵੰ  \n' +
//     '੧੦ਪਾਂੀ  \n' +
//     '੧੧ਰਾਹ ਦੀ ਥਕਾਣ ਦੀ  \n' +
//     '੧੨ਸੰਘਣੀ  \n' +
//     '੧੩ਸ੍ਰੇਸ਼ਟ ਫਲ  \n' +
//     '੧੪ਸਮੇਤ ਰਸ ਦੇ',
//   '੧੩੦੬\n' +
//     '\n' +
//     '         ਮਰਦਾਨਾ ਤੋਰੈ ਸੋ ਖਾਵਤਿ  \n' +
//     '         ਸਾਦ ਸੁਧਾ ਮਮ, ਅਧਿਕ ਅਘਾਵਤਿ੧ ॥੩੮॥ \n' +
//     'ਦੋਹਰਾ: ਛੋਰਿ ਸਕੈ ਨਹਿਣ ਖਾਇ ਬਹੁ \n' +
//     '         ਗਰ ਲੌ ਅੁਦਰੰ ਪੂਰ੨  \n' +
//     '         ਤੋਰਿ੩ ਚੀਰ੪ ਮਹਿਣ੫ ਪਾਇ ਕਛੁ \n' +
//     '         ਬਾਣਧੇ੬ ਸਾਦੰ੭ ਭੂਰ੮ ॥੩੯॥ \n' +
//     'ਚੌਪਈ: ਬੈਸੋ ਗੁਰ ਸਮੀਪ ਸੋ ਆਨਾ੯  \n' +
//     '         ਬਿਗਸਤਿ ਬੋਲੇ ਮਯਾਨਿਧਾਨਾ  \n' +
//     '         ਜੇ ਨ ਅਘਾਯੋ ਔਰਹਿ ਲੀਜੈ  \n' +
//     '         ਮਨ ਭਾਵਨ ਸੇ ਖਾਵਨ ਕੀਜੈ ॥੪੦॥ \n' +
//     '         ਸ਼੍ਰੀ ਪ੍ਰਭੁ! ਮੈਣ ਬਹੁ ਰਹੋ ਅਘਾਈ੧੦  \n' +
//     '         ਖਾਵਨ ਤ੍ਰਿਸ਼ਨਾ ਸਕਲ ਮਿਟਾਈ  \n' +
//     '         ਜੇ ਅਬ ਰਾਵਰ ਕੀ ਰੁਚਿ ਦੇਵਨ  \n' +
//     '         ਇਕ ਦੁਇ ਦਿਹੁ ਖਾਵਅੁਣ ਕਰ ਲੇਵਨ੧੧ ॥੪੧॥ \n' +
//     '         ਨਿਜ ਕਰ ਸੋਣ ਗੁਰ ਫਰ੧੨ ਜੁਗ ਦੀਨੇ  \n' +
//     '         ਲੇ ਕਰਿ ਤਬ ਹੀ ਖਾਵਨ ਕੀਨੇ  \n' +
//     '         ਖਾਨੇ ਕੀ ਰੁਚਿ ਅੁਦਰ ਅਘਾਯੋ  \n' +
//     '         ਤਿਹ ਛਿਨ ਬਹੁਰੋ ਬੈਨ ਅਲਾਯੋ ॥੪੨॥ \n' +
//     'ਦੋਹਰਾ: ਸਾਦ ਸੁਧਾ ਸਮ ਫਲ ਮਧੁਰ, ਇਹਾਂ ਕੌਨ ਇਨ ਖਾਇ  \n' +
//     '         ਕਿਧੋਣ ਬਾਦ ਏ ਜਾਵਈ, ਮਾਨਵ ਕੋ ਨ ਦਿਸਾਇ ॥੪੩॥ \n' +
//     'ਚੌਪਈ: ਗੁਰ ਕਹਿਣ ਜੇ ਨਹਿਣ ਖਾਵਨਵਾਰੋ੧੩  \n' +
//     '         ਕਿਅੁਣ ਅੁਪਜਤਿ ਇਹ ਰਿਦੇ ਬਿਚਾਰੋ  \n' +
//     '                                                \n' +
//     '੧ਰਜ਼ਜ ਰਜ਼ਜ ਕੇ ਖਾਂਦਾ ਹੈ  \n' +
//     '੨ਗਲ ਤਕ ਪੇਟ ਲ਼ ਭਰਕੇ  \n' +
//     '੩ਤੋੜਕੇ  \n' +
//     '੪ਬਸਤਰ  \n' +
//     '੫ਵਿਚ  \n' +
//     '੬ਬੰਨ੍ਹੇ  \n' +
//     '੭ਸਵਾਦ ਵਾਲੇ  \n' +
//     '੮ਬਹੁਤੇ  \n' +
//     '੯ਆ ਕਰਕੇ  \n' +
//     '੧੦ਤ੍ਰਿਪਤ ਹੋ ਗਿਆ ਹਾਂ  \n' +
//     '੧੧ਆਪਦੇ ਹਜ਼ਥੋਣ ਲੈਕੇ ਖਾਵਾਣ  \n' +
//     '੧੨ਫਲ  \n' +
//     '੧੩ਖਾਵਨ ਵਾਲਾ',
// ];
